cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'buo/cask-upgrade'
tap 'homebrew/bundle'

brew 'mas'
brew 'ripgrep'
brew 'ack'
brew 'wget'
brew 'unrar'
brew 'git'
brew 'hg'
brew 'bzr'
brew 'htop'
brew 'ctags'
brew 'cask'
brew 'ruby'
brew 'python'
brew 'vim', args: ['with-override-system-vim']
brew 'zsh'
brew 'packer'
brew 'postgresql'
brew 'postgis'
brew 'youtube-dl'
brew 'aria2'
brew 'ansible'
brew 'midnight-commander'
brew 'mongodb'
brew 'nvm'
brew 'watchman'
brew 'gnu-sed'
brew 'curl'
brew 'go', args: ["cross-compile-common"]

cask 'google-chrome'
cask 'firefox'
cask 'postman'
cask 'caffeine'
cask 'cyberduck'
cask 'monolingual'
cask 'tunnelblick'
cask 'postman'
cask 'skype'
cask 'iterm2'
cask 'gimp'
cask 'inkscape'
cask 'the-unarchiver'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'vagrant'
cask 'docker'
cask 'kitematic'
cask 'chefdk'
cask 'vlc'
cask 'java'
cask 'atom'
cask 'google-cloud-sdk'
cask 'visual-studio-code'
cask 'mongodb-compass-beta'

mas 'Xcode', id: 497799835
mas 'Day One', id: 1055511498
mas 'Kindle', id: 405399194
mas 'Pixelmator', id: 407963104
mas 'Go2Shell', id: 445770608
mas 'MONIT', id: 1014850245
mas 'Microsoft Remote Desktop', id: 715768417
